{
    "abdulrashid-sufi": "Abdul Rashid Ali Sufi is a Somali Qur'an reciter. He was born in 1964 to the reciter and preacher Ali Abdul Rahmane Sufi, who did a lot for the Qur'an recitation in Somalia.\n\nAbdul Rashid Ali Sufi's father has also taught numerous theologians. He built many schools and institutes for teaching and learning the Holy Qur’an. He founded the famous mosque of Mogadishu he called Al Cheikh Ali Sufi Mosque.\n\nAbdul Rashid Ali Sufi first learnt the Qur’an at the mosque and finished memorizing it at the age of ten. He certainly owed to his father many of his skills. He taught him different recitations and the interpretations of the Qur'an and the Fiqh.\n\nAbdul Rashid Ali Sufi went to Egypt in 1981 where he enrolled in the Qur'an Recitations institute and earned a high certificate in the ten recitations. In parallel, Abdul Rashid carried out studies in Al Azhar Mosque and was awarded by the late Cheikh Mohamed Ibn Ismail Al Hamdani two degrees in the ten recitations.\n\nBack to Somalia, Abdul Rashid Ali Sufi started teaching and led prayers in his father's mosque. He then toured many Arab countries to teach the Qur'an's sciences. He taught in Egypt, Qatar where he was nominated imam and preacher of the Anas Ibn Malik's Mosque in Doha.",
    "abdulbasit": "Abdulbasit Abdusamad is a renowned Qur'an reciter born in 1927 in a village called Almara'za in Egypt.\nHe learned the Holy Quran at an early age from Shaykh Mohamed El Amir and later from Mohamed Selim Hamada. He entered the National Radio Station in 1951. The first surah he recited was Surah Fater.\nIn 1952, Abdulbasit Abdulsamad was appointed official reciter to Al-Imam Achafiî's mosque and then to Al-Imam Al Hussain's mosque in 1985.\nAbdulbasit has left a fortune of high qualified recordings of both the chanted Holy Scripture and the recited one. He was an ambassador of the Holy Qur'an across many countries and the first president of the Egyptian reciter's Bar in 1984.\nAbdulbasit Abdusamad went to many Arab countries to recite the Qur'an in Ramadan such as Saudi Arabia and Syria.\nHe died on November the 30th, 1988. May Allah have mercy on his soul, bless him and grant him a place in Jannah."
}
